app/admin/organizations.rb

      f.input :other_network
      f.input :address
      f.input :region
      f.input :zones, as: :check_boxes, nested_set: true, parent: "organization[zone_ids][]", parent_ids: resource.zone_ids, collection: Zone.where(ztype: 1)
---
SELECT "zones".* FROM "zones" WHERE "zones"."ztype" = $1  [["ztype", 1]]