app/admin/zones.rb

SELECT "zones".* FROM "zones"
---
      f.input :name
      f.input :ztype
      f.input :geometry
      f.input :parent_zone, :as => :searchable_select, collection:  Zone.all.map{|s| ["#{s.name} - #{s.ztype}", s.id]}